Michael-VT/STM32F769I-Disco/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
//#include "../Components/otm8009a/otm8009a.h"
#include "../../Drivers/BSP/Components/otm8009a/otm8009a.h"
//#include "otm8009a.h"
#include "../../Drivers/BSP/Components/otm8009a/otm8009a.h"
#include "../../Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery.h"
#include "../../Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_lcd.h"
#include "../../Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_sdram.h"
#include "main.h"
#include "cmsis_os.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"
//#include <stm32f769i_discovery.h>
//#include <stm32f769i_discovery_lcd>
//#include <stm32f769i_discovery_sdram.h>
#include "../../Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_ts.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

I2C_HandleTypeDef hi2c1;

LTDC_HandleTypeDef hltdc;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 4096 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_LTDC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_I2C1_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LTDC_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_DSIHOST_DSI_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN 2 */
  uint32_t ts_status = TS_OK;
  uint8_t lcd_status = LCD_OK;
  BSP_LCD_Init();
  ts_status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
  while(ts_status != LCD_OK);
  while(lcd_status != LCD_OK);

  /* Эти три строки = всё, что нужно для дисплея на вашей плате */
//  BSP_LCD_Init();           // полная инициализация OTM8009A + SDRAM Normal Mode
//  BSP_LCD_LayerDefaultInit(0, 0xC0000000);
//  BSP_LCD_SelectLayer(0);
//  BSP_LCD_Clear(LCD_COLOR_WHITE);
//  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
//  BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
  BSP_LCD_SetBrightness(100);
  BSP_LCD_Init();                    // ← теперь видит функцию
  BSP_LCD_LayerDefaultInit(0, 0xC0000000);
  BSP_LCD_SelectLayer(0);
//  BSP_LCD_Clear(LCD_COLOR_WHITE); // Grock
  // Важно: в ARGB8888 белый цвет = 0xFFFFFFFF, а не 0xFFFF!
  BSP_LCD_Clear(0xFFFFFFFF);  // вместо LCD_COLOR_WHITE
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
  BSP_LCD_DisplayStringAt(0, 10, (uint8_t*)"Hello from FreeRTOS!", CENTER_MODE);

  // Инициализация дисплея (как раньше)
  BSP_SDRAM_Init();
  HAL_Delay(100);
  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit(0, SDRAM_DEVICE_ADDR);
  BSP_LCD_SelectLayer(0);
  TIM_HandleTypeDef        htim1;
  // Включаем PWM подсветку (TIM1-CH3N на PI9)
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);  // Запуск PWM
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 500);  // 50% яркость (измените на 999 для 100%)

  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of defaultTask */
  defaultTaskHandle = osThreadNew(StartDefaultTask, NULL, &defaultTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

